<template>
    <div>
        <div class="container">
            <h1 class="title"> Իրազեկ Համաձայնության Ձև</h1>
            <p> 
            Բարև Ձեզ: <br> <br>
            Մենք հրավիրում ենք Ձեզ մասնակցելու սույն հետազոտությանը, որի նպատակն է` ուսումնասիրել Հայասատանում ուռուցքաբանների 
            շրջանում հուզական այրման տարածվածությունը և այն պայմանավորող գործոնները։ <br>
                Հետազոտությունը կտևի ոչ ավել քան 15 րոպե: Հետազոտության ընթացքում Ձեզ կտրվեն հարցարաններ: Խնդրում ենք հարցարանները 
            լրացնել ինքնուրույն: Ձեր պատասխանները կընդհարացվեն մյուս մասնակիցների պատասխանների հետ, և ոչ մի անձնական տեղեկություն չի 
            ներկայացվի հետազոտության զեկույցներում: <br>
                Ձեր անձի գաղտնիությունը լիովին երաշխավորվում է: Լրացված հարցաթերթիկները կարխիվացվեն 
            և կպահվեն ապահով վայրում, իսկ վերջնական վերլուծությունից հետո` կոչնչացվեն: Ձեր մասնակցությունն այս հետազոտությանը կամավոր է: 
            Ձեզ ոչինչ չի սպառնում, եթե Դուք հրաժարվեք մասնակցությունից: <br>
                Դուք կարող եք հրաժարվել պատասխանել ցանկացած հարցի կամ ցանկացած պահի ընդհատել Ձեր մասնակցությունը: Դուք չեք ստանալու որևէ
            ֆինանսական հատուցում կամ պարգևատրում հետազոտությանը մասնակցելու դեպքում: <br> 
                Դուք ոչ մի ռիսկի չեք դիմում մասնակցելով այս հետազոտությանը: Ձեր անկեղծ պատասխանները կօգնեն այս հետազոտության իրականացնմանը, 
            որը թույլ կտա ավելի լավ հասկանալ Հայասատանում ուռուցքաբանների շրջանում հուզական այրումը պայմանավորող գործոնները և մշակել կանխարգելման 
            հնարավոր եղանակաները: Այս հետազոտության վերաբերյալ հարցեր ունենալու դեպքում կարող եք զանգահարել հետազոտության համակարգողին՝ 
            Եվա Ասրիբաբայանին (+37493) 058794 հեռախոսահամարով: <br> <br>
            Համաձա՞յն եք մասնակցել 
            </p>
             
                <button id="no" class="btn btn-primary mb-2"> 
                    <router-link to="/refuse"> <a>Ոչ</a></router-link>
                </button> 
                <button id="yes" class="btn btn-primary mb-2" @click="seTimeOut()">
                    <router-link to="/demographics"> <a> Այո </a></router-link>
                </button> 
                
            <div id="buttons">
                
            </div>
        </div>
    </div>
</template>

<script>
export default {
    methods: {
        seTimeOut(){
            this.$store.state.data.consentTime = Date.now()
        }
    },
}
</script>

<style scoped>
p{
    text-align: justify;
    font-size: 20px;
}
h1{
    padding-left: 15rem;
    padding-bottom: 3rem;
}

#no{
    margin-right: 80%;
}

a{
    color: white;
}

button{
    padding-left: 2rem;
    padding-right: 2rem;

}

</style>