<template>
    <div>
        <div class="container">
            <h4>{{ instructions }}</h4>
        </div>
        <div class="card"> 
            <table>
                  <tbody>
                    <tr>
                      <td style="text-align: left;">{{questions[step][0]}}</td>
                      <td>
                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=1 v-model="selected">
                        <label class="form-check-label" :for="step"> 3 </label>

                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=2 v-model="selected">
                        <label class="form-check-label" :for="step"> 2 </label>

                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=3 v-model="selected">
                        <label class="form-check-label" :for="step"> 1 </label>

                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=4 v-model="selected">
                        <label class="form-check-label" :for="step"> 0 </label>

                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=5 v-model="selected">
                        <label class="form-check-label" :for="step"> 1 </label>

                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=6 v-model="selected">
                        <label class="form-check-label" :for="step"> 2 </label>

                        <input class="form-check-input" type="radio"
                          :name="step" :id="step" value=7 v-model="selected">
                        <label class="form-check-label" :for="step"> 3 </label>
                      </td>
                      <td style="text-align: left;">{{questions[step][0]}}</td>
                    </tr>
                  </tbody>
                </table>
            <button class="btn btn-primary mb-2" @click="next">Next</button>
        </div>
    </div>
</template>


<script>
export default {
    data() {
        return {
            instructions: `Ձեզ կառաջարկվեն հակադիր պնդումների զույգեր։ 
                            Ձեր առաջադրանքն է ընտրել 2 պնդումներից Ձեր կարծիքին առավել համապատասխանը,
                            և նշել 1, 2, 3 թվերից մեկը՝ կախված նրանից, թե որքան եք վստահ Ձեր ընտրության մեջ
                            (կամ 0, եթե 2 պնդումն էլ Ձեզ համար հավասարապես ճիշտ են)։`,
            
            questions: {1: [`Սովորաբար ես շատ եմ ձանձրանում։`,
                            `Սովորաբար ես էներգիայով լի եմ։`],
                        2: [ `Կյանքը ինձ միշտ թվում է հուզառատ և հետաքրքիր։`,
                            `Կյանքը ինձ թվում է բացարձակապես հանգիստ է և միապաղաղ։`],
                        3: [ `Այս կյանքում ես չունեմ որոշակի նպատակներ և միտումներ։`,
                            `Այս կյանքում ես ունեմ հստակ նպատակներ և միտումներ։`],
                        4: [ `Իմ կյանքը ինձ թվում է ծայրահեղ անիմաստ է և աննպատակ։`,
                            `Իմ կյանքը ինձ թվում է բավականին իմաստավորված է և նպատակաուղղված։`],
                        5: [ `Ամեն օրը ինձ թվում է նոր և մյուսներից տարբերվող։`,
                            `Ամեն օրը ինձ թվում է բացարձակապես նման մնացած բոլոր օրերին։`],
                        6: [ `Թոշակի անցնելուց հետո, ես կզբաղվեմ այնպիսի հետաքրքիր գործերով, որոնցով միշտ երազել եմ զբաղվել։`,
                            `Թոշակի անցնելուց հետո, ես կփորձեմ չծանրաբեռնել ինձ որևէ հոգսերով։`],
                        7: [ `Իմ կյանքը դասավորվել է հենց այնպես, ինչպես երազել եմ։`,
                            `Իմ կյանքը դասավորվել է բոլորովին ոչ այնպես, ինչպես երազել եմ։`],
                        8: [ `Ես հաջողությունների չեմ հասել իմ կյանքի ծրագրերի իրականացման մեջ։`,
                            `Ես իրագործել եմ կյանքում իմ պլանավորվածի մեծ մասը։`],
                        9: [ `Իմ կյանքը դատարկ է և անհետաքրքիր։`,
                            `Իմ կյանքը լցված է հետաքրքիր գործերով։`],
                        10: [ `Եթե անհրաժեշտ լիներ այսօր ամփոփել իմ կյանքը, ապա ես կասեի, որ այն բավականաչափ իմաստավորված է։`,
                            `Եթե անհրաժեշտ լիներ այսօր ամփոփել իմ կյանքը, ապա ես կասեի, որ այն իմաստ չի ունեցել։`],
                        11: [ `Եթե ես ընտրության հնարավորություն ունենայի, ապա կկառուցեի իմ կյանքը ամբողջովին այլ կերպ։`,
                            `Եթե ես ընտրության հնարավորություն ունենայի, ես իմ կյանքը նորից կապրեի այնպես, ինչպես հիմա։`],
                        12: [ `Երբ ես նայում եմ ինձ շրջապատող աշխարհին, այն հաճախ է ինձ մոտ առաջացնում է շփոթվածություն և անհանգստություն։`,
                            `Երբ ես նայում եմ ինձ շրջապատող աշխարհին, այն ինձ մոտ բացարձակապես չի առաջացնում շփոթվածություն կամ անհանգստություն։`],
                        13: [ `Ես շատ պատասխանատու մարդ եմ։`,
                            `Ես բացարձակապես պատասխանատու մարդ չեմ։`],
                        14: [ `Ես կարծում եմ, որ մարդը հնարավորություն ունի իրականացնելու իր կենսական ընտրությունը ըստ իր ցանկության։`,
                            `Ես կարծում եմ, որ մարդը զրկված է ընտրության հնարավորությունից՝ բնական կարողությունների և պարտականությունների ազդեցության պատճառով։`],
                        15: [ `Ես միանշանակ կարող եմ ինձ նպատակասլաց մարդ կոչել։`,
                            `Ես չեմ կարող ինձ նպատակասլաց մարդ կոչել։`],
                        16: [ `Ես դեռ չեմ գտել կյանքում իմ կոչումն ու հստակ նպատակները։`,
                            `Ես գտել եմ կյանքում իմ կոչումն ու նպատակները։`],
                        17: [ `Իմ աշխարհայացքը դեռ չի ձևավորվել։`,
                            `Ես ունեմ որոշակի ձևավորված աշխարհայացք։`],
                        18: [ `Ես համարում եմ, որ ինձ հաջողվել է գտնել կյանքում իմ կոչումն ու հետաքրքիր նպատակները։`,
                            `Ես հազիվ թե ընդունակ եմ գտնել իմ կոչումն ու հետաքրքիր նպատակները կյանքում։`],
                        19: [ `Իմ կյանքը իմ ձեռքերում է, ես ինքս եմ այն կառավարում։`,
                            `Իմ կյանքը իմ ենթակայության տակ չէ և այն կառավարվում է արտաքին իրադարձություններով։`],
                        20: [ `Իմ առօրյա գործերը ինձ հաճույք և բավարարվածություն են պատճառում։`,
                            `Իմ առօրյա գործերը ինձ միայն տհաճություններ և անհանգստություններ են պատճառում։ `]},
            step: 1,
            selected: null,
            answers:[{}],
        }
    },
    methods: {
        next() {
            this.step++;
            this.answers.push(this.selected);
            this.selected = null;
        }
    },
}
</script>

<style scoped>

.card{
    margin-top:3rem;
    box-shadow: 0 10px 20px rgba(0,0,0,0.19), 0 6px 6px rgba(0,0,0,0.23);
}

p{
    font-size: 1.5rem;
}

td{
    width: 12rem;
    padding:1rem;
}

input{
    display: inline-block;
    position: relative;
    margin: 0.1rem;
    width: 2rem;
    height: 1.5rem;
    cursor:pointer;
}

label{
    margin:0;
    padding: 0;
}

button{
    margin-left: 90%;
    margin-right: 5%
}

</style>